#作者：Ourjune
#开发时间：2021/11/23 8:21
#格式化字符串
# %s表示字符串  %i或者%d代表整数  %f代表浮点数

#(1)% 作为占位符
name='张三'
age=20
print('我叫%s,今年%d岁'%(name,age))
#（2）{}作为占位符
print('我叫{0},今年{1}岁'.format(name,age))
#(3)f-string
print(f'我叫{name},今年{age}岁')
print('----------------------')
print('%d'%99)
print('%10d'%99) #10表示10个字符的宽度
print('%.3f'%3.1415926) #3表示精度
#同时表示宽度和精度
print('%10.3f'%3.141231) #总宽度为10，小数点后三位
print('========================')
print('{0}'.format(3.1415926))
print('{0:.3}'.format(3.1415926))#.3表示一共三位数
print('{0:.3f}'.format(3.1415926))#.3f表示是3位小数
print('{0:10.3f}'.format(3.1415926))#一共10位，3位是小数
